{
    "Scientific Name": "celastrus scandens ",
    "Common Name": "American bittersweet",
    "Type": "Vine",
    "Family": "Celastraceae",
    "Native Range": "North America",
    "Zone": "3 to 8",
    "Height": "15.00 to 20.00 feet",
    "Spread": "3.00 to 6.00 feet",
    "Bloom Time": "May to June",
    "Bloom Description": "Greenish-white to yellow",
    "Sun": "Full sun",
    "Water": "Medium",
    "Maintenance": "Low",
    "Suggested Use": "Naturalize",
    "Flower": "Showy",
    "Attracts": "Birds",
    "Fruit": "Showy",
    "Other": "Winter Interest",
    "Tolerate": "Deer, Drought",
    "Noteworthy Characteristics": "Celastrus scandens, commonly called American bittersweet, is a deciduous twining woody vine that is best known for its showy red berries that brighten up fall and winter landscapes. This species is native to central and eastern North America including Missouri. In Missouri, bittersweet is typically found in woodland areas, thickets, rocky slopes, bluffs, glade peripheries and along fence rows throughout the State (Steyermark). It is often seen growing along the ground, over and through low shrubs or circling trees in the wild. Berry-laden branches are prized for use as indoor decorations, and collection of the branches in the wild has significantly reduced the wild populations in some areas. Rapidly grows to 20’. It produces serrate, elliptic to ovate, yellowish-green leaves (to 4” long). Staminate and pistillate flowers appear in clusters on separate plants in late spring. Flowers are greenish-white to yellow. Fertilized female flowers give way in summer to spherical orange-yellow fruits. Fruits split open in fall to reveal scarlet fleshy berry-like seeds (arils). Fruits are poisonous if ingested, but are considered to be quite tasty by many birds.Genus name comes from the Greek wordkelastrosfor an evergreen tree.Specific epithet means climbing.In the 1700s, plants were given the name bittersweet by European colonists because their fruits purportedly resembled in appearance the fruits of a Eurasian nightshade (Solanum dulcamara) that was known to them as bittersweet. The common name of false bittersweet also came to be used for the within species to distinguish it from the Eurasian nightshade. American bittersweet is the generally accepted common name that is used today, in large part to distinguish this American native from its aggressive Asiatic relative,C. orbiculatus(Oriental bittersweet) which has escaped cultivation and is naturalizing in parts of eastern and central North America."
}