{
    "Scientific Name": "ilex opaca ",
    "Common Name": "American holly",
    "Type": "Broadleaf evergreen",
    "Family": "Aquifoliaceae",
    "Native Range": "Eastern and central United States",
    "Zone": "5 to 9",
    "Height": "15.00 to 30.00 feet",
    "Spread": "10.00 to 20.00 feet",
    "Bloom Time": "May",
    "Bloom Description": "Creamy white",
    "Sun": "Full sun to part shade",
    "Water": "Medium",
    "Maintenance": "Low",
    "Flower": "Insignificant",
    "Leaf": "Evergreen",
    "Attracts": "Birds",
    "Fruit": "Showy",
    "Other": "Winter Interest, Thorns",
    "Tolerate": "Deer, Clay Soil, Air Pollution",
    "Noteworthy Characteristics": "Ilex opaca, commonly called American holly, is an upright, pyramidal, evergreen tree that slowly matures to 15-30' in cultivation, but may reach 50' tall in the wild.  It is native to the eastern and central U.S., most frequently found in moist woods, forest bottomlands and swamp peripheries plus some coastal dunes (e.g., Cape Cod down the Atlantic Coast) from Massachusetts to West Virginia to Ohio to southeastern Missouri south to Texas and Florida.  This species is easily identified because it is the only native U.S. holly with spiny green leaves and bright red berries.  This is the Christmas holly whose berry-laden boughs are typically collected at Christmas time each year for ornamentation (\"decking the halls\" as it were).  Thick, leathery, deep green leaves (2-4\" long) have spiny marginal teeth.  Species is dioecious (male and female flowers are on separate trees).  Greenish-white flowers bloom May-June (male flowers in 3-12 flowered clusters and female flowers solitary or in 2s or 3s).  Bright red or orange fruits (drupes to 1/4- 1/2\" diameter) ripen in fall on pollinated female trees, and persist on the tree through winter.  Birds love the fruit.Genus name comes from the Latin nameQuercus ilexfor holm oak in reference to the foliage similarities (holm oak and many of the shrubs in the genusIlexhave evergreen leaves).Specific epithet means opaque or dull, in reference to the non-lustrous leaf surfaces of species plants (many of the cultivars have more lustrous foliage)."
}