{
    "Scientific Name": "aralia racemosa ",
    "Common Name": "American spikenard",
    "Type": "Herbaceous perennial",
    "Family": "Araliaceae",
    "Native Range": "North America",
    "Zone": "3 to 8",
    "Height": "3.00 to 5.00 feet",
    "Spread": "3.00 to 5.00 feet",
    "Bloom Time": "June to August",
    "Bloom Description": "White",
    "Sun": "Full sun to part shade",
    "Water": "Medium",
    "Maintenance": "Low",
    "Suggested Use": "Naturalize",
    "Flower": "Showy",
    "Tolerate": "Drought",
    "Noteworthy Characteristics": "Aralia racemosa, commonly called American spikenard, is a rhizomatous, shrubby-looking, soft-stemmed, herbaceous perennial of the Ginseng family that is native to moist rich woods from Quebec to Manitoba south to Kansas, Missouri, Mississippi and Georgia.  In Missouri, it is typically found on wooded slopes and ravines, shaded moist ledges, and bluffs in the northern and eastern parts of the State and in the Ozark Mountains, but is absent from the unglaciated prairie regions in west central and southwestern Missouri south of the Missouri River (Steyermark).Glabrous, freely branching, dark maroon to near black stems rise from large aromatic roots to 3-5' tall (infrequently to 10') bearing few but very large 2-3 pinnate compound leaves (to 2 1/2' long) each of which is divided and subdivided into 9-21 coarse oval-rounded leaflets (each to 2-6\" long) with toothed margins, cordate bases and pointed tips.  Small but numerous umbels of tiny greenish-white flowers (to 1/8\" across) bloom in long upright terminal but sometimes axillary panicles (each to 12-18\" long) in early to mid-summer (June to August).  Flowers are followed by dense hanging clusters of basically inedible berries (drupes to 1/4\" diameter) which mature to dark purple.  Berries are attractive to birds.  Thick roots have been used to flavor teas and as an ingredient in root beer.  A poultice made from the roots was formerly used for a variety of medicinal purposes including treatment of infections, burns, skin irritations, ulcers, and swellings.Genus name comes from the Latinization of the old French-Canadian name ofaralie.Specific epithet from the Latin wordracemosusmeaning flowers in racemes. Glabrous, freely branching, dark maroon to near black stems rise from large aromatic roots to 3-5' tall (infrequently to 10') bearing few but very large 2-3 pinnate compound leaves (to 2 1/2' long) each of which is divided and subdivided into 9-21 coarse oval-rounded leaflets (each to 2-6\" long) with toothed margins, cordate bases and pointed tips.  Small but numerous umbels of tiny greenish-white flowers (to 1/8\" across) bloom in long upright terminal but sometimes axillary panicles (each to 12-18\" long) in early to mid-summer (June to August).  Flowers are followed by dense hanging clusters of basically inedible berries (drupes to 1/4\" diameter) which mature to dark purple.  Berries are attractive to birds.  Thick roots have been used to flavor teas and as an ingredient in root beer.  A poultice made from the roots was formerly used for a variety of medicinal purposes including treatment of infections, burns, skin irritations, ulcers, and swellings.Genus name comes from the Latinization of the old French-Canadian name ofaralie.Specific epithet from the Latin wordracemosusmeaning flowers in racemes."
}