{
    "Scientific Name": "taxodium distichum ",
    "Common Name": "bald cypress",
    "Type": "Tree",
    "Family": "Cupressaceae",
    "Native Range": "Southeastern United States",
    "Zone": "4 to 9",
    "Height": "50.00 to 70.00 feet",
    "Spread": "20.00 to 45.00 feet",
    "Bloom Time": "Non-flowering",
    "Bloom Description": "Brown",
    "Sun": "Full sun",
    "Water": "Medium to wet",
    "Maintenance": "Low",
    "Suggested Use": "Rain Garden",
    "Leaf": "Good Fall",
    "Attracts": "Birds",
    "Fruit": "Showy",
    "Tolerate": "Deer, Clay Soil, Wet Soil, Air Pollution",
    "Noteworthy Characteristics": "Taxodium distichum, commonly called bald cypress, is a long-lived, pyramidal conifer (cone-bearing tree) which grows 50-70' tall (less frequently to 125'). Although it looks like a needled evergreen (same family as redwoods) in summer, it is deciduous (\"bald\" as the common name suggests). It is native to southern swamps, bayous and rivers, primarily being found in coastal areas from Maryland to Texas and in the lower Mississippi River valley to as far north as the southeast corner of Missouri. In the deep South, it is a familiar sight growing directly in swampy water, often in large strands, with its branches heavily draped with Spanish moss. In cultivation, however, it grows very well in drier, upland soils. Trunks are buttressed (flared or fluted) at the base, and when growing in water, often develop distinctive, knobby root growths (\"knees\") which protrude above the water surface around the tree. Soft, feathery, yellowish-green foliage (1/4\" long, flat needles in two ranks) turns an attractive orange/cinnamon-brown in fall. Rounded, wrinkled, 1 inch diameter, purplish-green cones mature to brown. Heavy, straight-grained, rot-resistant wood has been used for a variety of purposes including barrels, railroad ties and shingles. Closest relative is the dawn redwood (Metasequoia) which is also deciduous. State tree of Louisiana.Genus name comes from the Latin wordTaxusmeaning yew and the Greek wordeidosmeaning resemblance from a similarity of leaf shape.Specific epithet means is two ranks for the needle arrangement."
}