{
    "Scientific Name": "nyssa sylvatica ",
    "Common Name": "black gum",
    "Type": "Tree",
    "Family": "Nyssaceae",
    "Native Range": "Eastern North America",
    "Zone": "3 to 9",
    "Height": "30.00 to 50.00 feet",
    "Spread": "20.00 to 30.00 feet",
    "Bloom Time": "May to June",
    "Bloom Description": "Greenish white",
    "Sun": "Full sun to part shade",
    "Water": "Medium to wet",
    "Maintenance": "Low",
    "Suggested Use": "Shade Tree, Street Tree, Rain Garden",
    "Flower": "Insignificant",
    "Leaf": "Good Fall",
    "Attracts": "Birds",
    "Tolerate": "Clay Soil, Wet Soil, Black Walnut",
    "Noteworthy Characteristics": "Nyssa sylvatica, commonly called sour gum, is a slow-growing, deciduous, Missouri native tree which occurs in a wide range of soils south of the Missouri River in the southeastern quarter of the State. It is primarily a lowland tree found in low wet woods, bottomlands and pond peripheries, but also can be found on dry rocky wooded slopes and ravines. A stately tree with a straight trunk and rounded crown (more pyramidal when young) that typically grows 30-50' tall, but occasionally to 90'. Primarily dioecious (separate male and female trees), but each tree often has some perfect flowers. Small, greenish-white flowers appear in spring on long stalks (female flowers in sparse clusters and male flowers in dense heads). Although flowers are not showy, they are an excellent nectar source for bees. Flowers give way to oval, 1/2\" long fruits which are technically edible but quite sour (hence the common name). Fruits mature to a dark blue and are attractive to birds and wildlife. Spectacular scarlet fall color. Obovate to elliptic, entire to slightly toothed leaves (to 5\" long) are dark green above and paler below. Sometimes commonly called black tupelo. The closely related water tupelo (Nyssa aquatica) is a tree most often seen growing in standing water in swamps and bottomlands in the lower Mississippi valley and southeastern U.S. coastal areas, either in pure stands or in combination with bald cypress, water oaks and swamp cottonwoods.Genus name comes from Nysa or Nyssa, one of the water nymphs.Specific epithet means growing in the woods or forest-loving."
}