{
    "Scientific Name": "quercus macrocarpa ",
    "Common Name": "bur oak",
    "Type": "Tree",
    "Family": "Fagaceae",
    "Native Range": "Northern and central United States, southeastern Canada",
    "Zone": "3 to 8",
    "Height": "60.00 to 80.00 feet",
    "Spread": "60.00 to 80.00 feet",
    "Bloom Time": "April",
    "Bloom Description": "Yellowish-green",
    "Sun": "Full sun",
    "Water": "Dry to medium",
    "Maintenance": "Low",
    "Suggested Use": "Shade Tree, Rain Garden",
    "Flower": "Insignificant",
    "Fruit": "Showy",
    "Tolerate": "Drought, Clay Soil, Dry Soil",
    "Noteworthy Characteristics": "Quercus macrocarpa, commonly called bur oak or mossycup oak, is one of the most majestic of the native North American oaks. It is a medium to large sized deciduous oak of the white oak group that typically grows 60-80’ (less frequently to 150’) tall with a broad-spreading, rounded crown. Acorn cups are covered with a mossy scale or bur near the rim, hence the common names. It is native to a variety of habitats in central and eastern North America. Best growth occurs in bottomland soils, particularly in the Ohio River valley. In Missouri, it typically occurs in low woods and stream valleys in the Ozark region, but on dry upland soils in the unglaciated parts of the state north of the Missouri River (Steyermark). Insignificant monoecious yellowish-green flowers in separate male and female catkins appear in spring as the leaves emerge. Fruits are oval acorns (to 1 1/2” long), with fringed, burry cups that extend to approximately 1/2 to 3/4 the acorn length. Acorns are an important source of food for wildlife. Leathery, dark green leaves (6-12” long) with 5-9 rounded lobes are variable in shape, but usually have a pair of deep central sinuses that extend nearly to the midrib giving the leaf a waisted appearance. Fall color is an undistinguished yellow-brown. Twigs sometimes are ridged with corky wings.Genus name comes from the classical Latin name for oak trees.Specific epithet comes from the Greek wordsmacromeaning large andcarpameaning fruit in reference to the large acorn size."
}