{
    "Scientific Name": "lonicera sempervirens ",
    "Common Name": "trumpet honeysuckle",
    "Type": "Vine",
    "Family": "Caprifoliaceae",
    "Native Range": "Southeastern United States",
    "Zone": "4 to 9",
    "Height": "8.00 to 15.00 feet",
    "Spread": "3.00 to 6.00 feet",
    "Bloom Time": "May to June",
    "Bloom Description": "Scarlet/orange with yellow inside",
    "Sun": "Full sun to part shade",
    "Water": "Medium",
    "Maintenance": "Low",
    "Suggested Use": "Naturalize",
    "Flower": "Showy",
    "Attracts": "Birds, Hummingbirds, Butterflies",
    "Fruit": "Showy",
    "Tolerate": "Deer, Clay Soil, Black Walnut",
    "Invasive": "Where is this species invasive in the US?",
    "Noteworthy Characteristics": "Lonicera sempervirens, commonly called trumpet honeysuckle, is a vigorous, deciduous, twining vine which typically grows 10-15' (less frequently to 20') and is one of the showiest of the vining honeysuckles. It is primarily native to the southeastern U.S., but has escaped from gardens and naturalized in many other areas of the eastern U.S. including several counties in central and southern Missouri where it typically occurs along roadsides, along stream banks and in thickets (see Steyermark).Large, non-fragrant, narrow, trumpet-shaped flowers are scarlet to orangish red on the outside and yellowish inside. Flowers appear in late spring at stem ends in whorled clusters. They are attractive to hummingbirds, butterflies and bees. Inedible red berries form in late summer to early fall and can be ornamentally attractive.  The small red berries are attractive to birds. Oval, bluish-green leaves are glaucous beneath. This vine is evergreen in the warm winter climates of the deep South.Genus name honors Adam Lonitzer (1528-1586), German botanist, the author of an herbal (Kreuterbuch) many times reprinted between 1557 and 1783.Specific epithet means evergreen. Large, non-fragrant, narrow, trumpet-shaped flowers are scarlet to orangish red on the outside and yellowish inside. Flowers appear in late spring at stem ends in whorled clusters. They are attractive to hummingbirds, butterflies and bees. Inedible red berries form in late summer to early fall and can be ornamentally attractive.  The small red berries are attractive to birds. Oval, bluish-green leaves are glaucous beneath. This vine is evergreen in the warm winter climates of the deep South.Genus name honors Adam Lonitzer (1528-1586), German botanist, the author of an herbal (Kreuterbuch) many times reprinted between 1557 and 1783.Specific epithet means evergreen."
}