{
    "Scientific Name": "bignonia capreolata ",
    "Common Name": "cross vine",
    "Type": "Vine",
    "Family": "Bignoniaceae",
    "Native Range": "Southern Ontario, eastern United States",
    "Zone": "5 to 9",
    "Height": "35.00 to 50.00 feet",
    "Spread": "6.00 to 9.00 feet",
    "Bloom Time": "May to June",
    "Bloom Description": "Orange-red",
    "Sun": "Full sun to part shade",
    "Water": "Medium",
    "Maintenance": "Medium",
    "Flower": "Showy, Fragrant",
    "Attracts": "Hummingbirds",
    "Tolerate": "Heavy Shade",
    "Noteworthy Characteristics": "Bignonia capreolata, known as cross-vine, is a vigorous, woody vine that climbs by branched tendrils with adhesive disks.  It is grown primarily for its attractive flowers and its ability to rapidly cover structures with attractive foliage.  Opposite, compound leaves are bifoliate.  Each leaf consists of a pair of lanceolate to oblong dark green leaflets (to 6” long) and a branched tendril between them.  Tendril branches terminate in adhesive disks that easily attach to walls.  Foliage remains evergreen in the South, but turns reddish-purple in fall with subsequent leaf drop in the colder winter areas of its range.  Axillary clusters (2-5 flowered cymes) of fragrant, trumpet-shaped, orange-red flowers (to 2” long) appear in spring.  Flowers are followed by greenish, pod-like seed capsules (to 7” long) which mature in late summer and persist into fall.This vine is in the same family as and closely related toCampsis radicanswhich is commonly known as trumpet vine.Genus name honors of Abbe Jean Paul Bignon (1662-1743), Librarian to Louis XIV.Specific epithet means having tendrils.A cross section of stem reveals a marking resembling the Greek cross, hence the common name. This vine is in the same family as and closely related toCampsis radicanswhich is commonly known as trumpet vine.Genus name honors of Abbe Jean Paul Bignon (1662-1743), Librarian to Louis XIV.Specific epithet means having tendrils.A cross section of stem reveals a marking resembling the Greek cross, hence the common name."
}