{
    "Scientific Name": "aristolochia tomentosa ",
    "Common Name": "Dutchman's pipe",
    "Type": "Vine",
    "Family": "Aristolochiaceae",
    "Native Range": "Southeastern and south-central United States",
    "Zone": "5 to 8",
    "Height": "20.00 to 30.00 feet",
    "Spread": "5.00 to 10.00 feet",
    "Bloom Time": "May to June",
    "Bloom Description": "Greenish yellow",
    "Sun": "Full sun to part shade",
    "Water": "Medium",
    "Maintenance": "Low",
    "Flower": "Showy",
    "Attracts": "Butterflies",
    "Noteworthy Characteristics": "Aristolochia tomentosa, commonly called Dutchman's pipe, is a woody, deciduous, twining vine which is native to Missouri where it typically occurs along streams and in moist woods primarily in counties south of the Missouri River. It is typically seen in the wild climbing trees or shrubs and can rapidly grow to 20-30' tall. Features large, heart-shaped, densely-overlapping leaves (4-8\" long) which can quickly cover an arbor or trellis with deep green foliage. Blooms in mid to late spring in the St. Louis area. Although the flowers make interesting conversation pieces, they are usually hidden by the dense foliage and are somewhat inconspicuous. Flowers give way to ribbed, tubular seed capsules (to 3\" long) which mature to a grayish-brown in September. The leaves, young stems and flowers of this species are hairy (tomentose as the species name suggests). Very similar toA. macrophyllawhich is native to eastern North America, exceptA. macrophyllais basically glabrous (smooth).Aristolochiais a larval plant for the pipe vine swallowtail butterfly.Genus name comes from the Greek wordsaristosmeaning best andlocheiameaning childbirth or delivery in reference to the fact that plants of some species within this genus (1) have a flower structure which more closely resembles a human fetus in the womb than a pipe, and (2) served in the past as the source of ancient plant preparations used for treatment of pain and infections incident to childbirth.Specific epithet means hairy.Commonly called Dutchman's pipe because the unusual, 2\" long, yellowish-green, curved-trumpet flowers (each flaring at the calyx mouth to form three brownish-purple lobes) superficially resemble Dutch smoking pipes."
}