{
    "Scientific Name": "hamamelis virginiana ",
    "Common Name": "common witch hazel",
    "Type": "Deciduous shrub",
    "Family": "Hamamelidaceae",
    "Native Range": "Eastern North America",
    "Zone": "3 to 8",
    "Height": "15.00 to 20.00 feet",
    "Spread": "15.00 to 20.00 feet",
    "Bloom Time": "October to December",
    "Bloom Description": "Yellow sometimes tinged with orange or red",
    "Sun": "Full sun to part shade",
    "Water": "Medium",
    "Maintenance": "Low",
    "Suggested Use": "Hedge, Naturalize, Rain Garden",
    "Flower": "Showy, Fragrant",
    "Leaf": "Good Fall",
    "Attracts": "Birds",
    "Other": "Winter Interest",
    "Tolerate": "Deer, Erosion, Clay Soil",
    "Noteworthy Characteristics": "Hamamelis virginiana, known as common witch hazel, is a fall-blooming, deciduous shrub or small tree that is native to woodlands, forest margins and stream banks in eastern North America.  It typically grows 15-20’ tall with a similar spread in cultivation, but can reach 30’ tall in its native habitat.  Stem-hugging clusters of fragrant bright yellow flowers, each with four crinkly, ribbon-shaped petals, appear along the branches from October to December, usually after leaf drop but sometimes at the time of fall color.  Fertilized flowers will form fruit over a long period extending through winter and into the following growing season.  Fruits are greenish seed capsules that become woody with age and mature to light brown.  Each seed capsule splits open in fall of the following year, exploding the 1-2 black seeds within for up to 30 feet.  Oval to obovate, medium to dark green leaves (to 6” long) with dentate to wavy margins turn quality shades of yellow in fall. Plants of this species are usually the last native flowering plants to bloom in Missouri each year.Genus name comes from the Greek wordshamameaning at same time andmelonmeaning apple or fruit in reference to the occurrence of both fruit and flowers at the same time on this shrub (particularly in the case of fall flowering members of the genus).Specific epithet means from Virginia."
}