{
    "Scientific Name": "cornus florida ",
    "Common Name": "flowering dogwood",
    "Type": "Tree",
    "Family": "Cornaceae",
    "Native Range": "Eastern North America",
    "Zone": "5 to 9",
    "Height": "15.00 to 30.00 feet",
    "Spread": "15.00 to 30.00 feet",
    "Bloom Time": "April to May",
    "Bloom Description": "White (bracts)",
    "Sun": "Full sun to part shade",
    "Water": "Medium",
    "Maintenance": "Medium",
    "Suggested Use": "Flowering Tree",
    "Flower": "Showy",
    "Leaf": "Good Fall",
    "Attracts": "Birds, Butterflies",
    "Fruit": "Showy",
    "Tolerate": "Deer, Clay Soil, Black Walnut",
    "Noteworthy Characteristics": "Cornus florida, commonly known as flowering dogwood, is a small deciduous tree that typically grows 15-30’ tall with a low-branching, broadly-pyramidal but somewhat flat-topped habit.  It arguably may be the most beautiful of the native American flowering trees.  It is native from Maine to southern Ontario to Illinois to Kansas south to Florida, Texas and Mexico.  It is the state tree of Missouri and Virginia.  It blooms in early spring (April) shortly after, but usually overlapping, the bloom period of the redbuds.  The true dogwood flowers are actually tiny, yellowish green and insignificant, being compacted into button-like clusters.  However, each flower cluster is surrounded by four showy, white, petal-like bracts which open flat, giving the appearance of a single, large, 3-4” diameter, 4-petaled, white flower.  Oval, dark green leaves (3-6” long) turn attractive shades of red in fall.  Bright red fruits are bitter and inedible to humans (some authors say poisonous) but are loved by birds. Fruits mature in late summer to early fall and may persist until late in the year.Genus name comes from the Latin wordcornusmeaning \"horn\", possibly in reference to the strength and density of the wood.Cornusis also the Latin name for cornelian cherry (Cornus mas). May also be related to the Greekkerasosmeaning \"cherry\".Specific epithet comes from the Latin wordflosflower in reference to its attractive spring flowers.Common name of dogwood is in probable reference to an old-time use of hard slender stems from this tree for making skewers once known as dags or dogs."
}