{
    "Scientific Name": "ribes odoratum ",
    "Common Name": "clove currant",
    "Type": "Deciduous shrub",
    "Family": "Grossulariaceae",
    "Native Range": "Central United States",
    "Zone": "4 to 8",
    "Height": "6.00 to 12.00 feet",
    "Spread": "6.00 to 8.00 feet",
    "Bloom Time": "April",
    "Bloom Description": "Yellow",
    "Sun": "Full sun to part shade",
    "Water": "Medium",
    "Maintenance": "Low",
    "Suggested Use": "Hedge",
    "Flower": "Showy, Fragrant",
    "Attracts": "Birds, Butterflies",
    "Fruit": "Showy, Edible",
    "Tolerate": "Rabbit, Drought, Erosion, Clay Soil",
    "Noteworthy Characteristics": "Ribes odoratum, commonly called clove currant, is a thornless, loosely-branched, irregularly-shaped, deciduous shrub that typically grows to 6-8’ tall and as wide.  It is native to slopes, rocky bluffs and streambanks from Minnesota and South Dakota south to Missouri, Arkansas, Oklahoma and Texas.  In Missouri, it is primarily found on limestone bluffs along the Current and White Rivers.  It has been widely planted in the eastern U.S. where it has escaped gardens and naturalized.Ovate to rounded, medium green to bluish-green, 3-5 lobed leaves turn dull yellow in fall.  Golden yellow trumpet-shaped flowers appear in racemes in spring and emit a strong clove-like fragrance.  Flowers give way to drooping clusters of large, oval-rounded, shiny black currants which ripen in late season (July in St. Louis).  Fruit can be eaten raw from the shrub or made into juices, jams, jellies, tarts and pies.Ribes odoratumis very closely related toRibes aureum, and is now being listed in some references asRibes aureumvar.villosum.The genus nameRibesis derived from the Arabicribas, the name used forRheum ribes(Syrian rhubarb), an unrelated, wild rhubarb species. European herbalists possibly connected the two due to the acidic flavor of the flowering stem ofR. ribes, or the visually similar panicles of red fruits.Specific epithet comes from the Latin wordodoratusmeaning fragrant in reference to the clove-scented flowers. Ovate to rounded, medium green to bluish-green, 3-5 lobed leaves turn dull yellow in fall.  Golden yellow trumpet-shaped flowers appear in racemes in spring and emit a strong clove-like fragrance.  Flowers give way to drooping clusters of large, oval-rounded, shiny black currants which ripen in late season (July in St. Louis).  Fruit can be eaten raw from the shrub or made into juices, jams, jellies, tarts and pies.Ribes odoratumis very closely related toRibes aureum, and is now being listed in some references asRibes aureumvar.villosum.The genus nameRibesis derived from the Arabicribas, the name used forRheum ribes(Syrian rhubarb), an unrelated, wild rhubarb species. European herbalists possibly connected the two due to the acidic flavor of the flowering stem ofR. ribes, or the visually similar panicles of red fruits.Specific epithet comes from the Latin wordodoratusmeaning fragrant in reference to the clove-scented flowers. Ribes odoratumis very closely related toRibes aureum, and is now being listed in some references asRibes aureumvar.villosum.The genus nameRibesis derived from the Arabicribas, the name used forRheum ribes(Syrian rhubarb), an unrelated, wild rhubarb species. European herbalists possibly connected the two due to the acidic flavor of the flowering stem ofR. ribes, or the visually similar panicles of red fruits.Specific epithet comes from the Latin wordodoratusmeaning fragrant in reference to the clove-scented flowers."
}