{
    "Scientific Name": "heuchera parviflora ",
    "Common Name": "littleflower alumroot",
    "Type": "Herbaceous perennial",
    "Family": "Saxifragaceae",
    "Native Range": "Southeastern United States",
    "Zone": "5 to 9",
    "Height": "0.50 to 1.50 feet",
    "Spread": "0.50 to 1.00 feet",
    "Bloom Time": "July to September",
    "Bloom Description": "White to pale pink",
    "Sun": "Part shade to full shade",
    "Water": "Dry to medium",
    "Maintenance": "Low",
    "Flower": "Showy",
    "Tolerate": "Rabbit, Deer, Shallow-Rocky Soil",
    "Noteworthy Characteristics": "Heuchera parviflora, commonly called littleflower alumroot or cave alumroot, is a herbaceous perennial native to the southern Appalachian Mountains and Appalachian Plateau from West Virginia south to Alabama, and west through the Ozark Mountains of Missouri and Arkansas. It can be found growing on shaded or north-facing rocky cliffs, ledges, and undercuts. Mature plants will have clumps of basal foliage reaching around 6-8\" tall with a 6-12\" spread. The more or less circular to reniform (kidney-shaped) leaves will reach 1-5\" wide, with 5-7 shallow lobes and scalloped margins. The lower leaf surfaces are often purplish in color. The inflorescences can reach 3.5-17.5\" long and are made up of open panicles of small, white to pink-tinted flowers with reflexed petals held on upright, leafless flowering stalks. Blooming begins in mid-summer and lasts to early fall. The leaves, petioles, and flowering stalks are covered in glandular hairs, giving them a sticky texture.Varietypuberulais found only in the Ozarks, southern Illinois, southern Indiana, and several sites in central Kentucky. It is distinguished from the species by having a denser covering of comparatively shorter glandular hairs.Genus name honors Johann Heinrich von Heucher (1677-1747), physician, botanist and medicinal plant expert at Wittenberg University, Germany.The specific epithetparviflorameans \"small flowered\", in reference to the size of the flowers of this species.\n\n\n\nThe infraspecific epithetpuberulameans \"having tiny hairs\", in reference to the pubescence of this variety which distinguishes it from the species.The common name littleflower alumroot refers to the size of the flowers and the common name cave alumroot refers to the preferred habitat of this species Varietypuberulais found only in the Ozarks, southern Illinois, southern Indiana, and several sites in central Kentucky. It is distinguished from the species by having a denser covering of comparatively shorter glandular hairs.Genus name honors Johann Heinrich von Heucher (1677-1747), physician, botanist and medicinal plant expert at Wittenberg University, Germany.The specific epithetparviflorameans \"small flowered\", in reference to the size of the flowers of this species.\n\n\n\nThe infraspecific epithetpuberulameans \"having tiny hairs\", in reference to the pubescence of this variety which distinguishes it from the species.The common name littleflower alumroot refers to the size of the flowers and the common name cave alumroot refers to the preferred habitat of this species"
}