{
    "Scientific Name": "quercus lyrata ",
    "Common Name": "overcup oak",
    "Type": "Tree",
    "Family": "Fagaceae",
    "Native Range": "Central and southern United States",
    "Zone": "5 to 9",
    "Height": "40.00 to 60.00 feet",
    "Spread": "40.00 to 60.00 feet",
    "Bloom Time": "March to April",
    "Bloom Description": "Yellow catkins (male); Red spikes (female)",
    "Sun": "Full sun",
    "Water": "Medium to wet",
    "Maintenance": "Low",
    "Suggested Use": "Shade Tree",
    "Flower": "Insignificant",
    "Leaf": "Good Fall",
    "Fruit": "Showy",
    "Tolerate": "Erosion, Clay Soil, Wet Soil",
    "Noteworthy Characteristics": "Quercus lyrata, commonly called overcup oak, gets its common name from the distinctive bur-like acorn cup that typically encloses 2/3 to almost all of the nut.  It is a medium sized deciduous oak (part of the white oak group) that typically grows to 40-60' tall with a straight trunk and broad rounded crown.  This is a bottomland tree that is native to floodplain forests, lowlands, and along swamps and bayous in the southeastern U.S.  It is particularly prevalent in coastal plain swamp forests from Texas to Florida north to New Jersey and up the Mississippi River valley to Missouri, southern Illinois and Indiana. Ornamentally insignificant flowers bloom in March or April (males in slender yellow catkins to 4-6\" long and females in short few-flowered reddish spikes).  Deep green leaves (6-10” long and to 4\" wide) with fuzzy white undersides each have 5-9  deep rounded lobes.  Leaves turn shades of yellow-brown (sometimes with orange and red) in fall.  Female flowers give way to acorns (to 1\" long) which mature in September to October. Overcup oaks usually do not begin bearing acorns until 25-30 years old.   Slightly shaggy gray to grayish-brown bark on mature trees is reminiscent of white oak.Genus name comes from the classical Latin name for oak trees.Specific epithet comes from the Latin wordlyrea stringed instrument in reference to the lyre-shaped leaves."
}