{
    "Scientific Name": "penstemon pallidus ",
    "Common Name": "pale beardtongue",
    "Type": "Herbaceous perennial",
    "Family": "Plantaginaceae",
    "Native Range": "Central and eastern United States",
    "Zone": "4 to 8",
    "Height": "1.50 to 2.50 feet",
    "Spread": "1.00 to 1.50 feet",
    "Bloom Time": "May to June",
    "Bloom Description": "White",
    "Sun": "Full sun to part shade",
    "Water": "Dry to medium",
    "Maintenance": "Low",
    "Flower": "Showy",
    "Attracts": "Butterflies",
    "Tolerate": "Deer, Drought, Dry Soil, Shallow-Rocky Soil",
    "Noteworthy Characteristics": "Penstemon pallidus, commonly known as pale beardtongue, is an herbaceous perennial that grows to 2 1/2’ tall.  It is native to a variety of habitats including dry or rocky open woods, glades, sandy soils on prairies, bluffs, rocky cliffs, abandoned fields and along railroads in the eastern and central U.S. from Maine to Michigan and Minnesota south to Georgia, Mississippi, Arkansas and Kansas.This penstemon is a downy perennial.  Stems, leaves, flowers, flower stalks and flower pedicels have pubescence of variable density.  Basal leaves form a rosette from which rises a central stem clad with narrow, lanceolate, partially-clasping, medium green stem leaves (to 2” long and to 3/4” wide).  The central stem is topped from mid spring to early summer (May-June) by a showy upright panicle (4-10” long) of two-lipped, tubular, white flowers (often with a pink tinge).  The upper lip of each flower has two lobes and the lower lip has three lobes.  Flowers are followed by ovoid seed capsules (to 1/4” long) which split open when ripe releasing numerous tiny seeds.The genus namePenstemonlikely comes from the Latinpaenemeaning \"almost\" or \"nearly\" and the Greekstemonmeaning \"stamen\". The name may also comes from the Greekpentameaning \"five\" andstemonmeaning \"stamen\". Both refer to the fifth, sterile stamen (staminode) that characterizes members of this genus.Specific epithet comes from Latin meaning pale in reference to the pale white flowers and pale green foliage.Penstemons are sometimes commonly called beardtongues because the unusual sterile stamen contained in each flower has a tuft of small hairs. This penstemon is a downy perennial.  Stems, leaves, flowers, flower stalks and flower pedicels have pubescence of variable density.  Basal leaves form a rosette from which rises a central stem clad with narrow, lanceolate, partially-clasping, medium green stem leaves (to 2” long and to 3/4” wide).  The central stem is topped from mid spring to early summer (May-June) by a showy upright panicle (4-10” long) of two-lipped, tubular, white flowers (often with a pink tinge).  The upper lip of each flower has two lobes and the lower lip has three lobes.  Flowers are followed by ovoid seed capsules (to 1/4” long) which split open when ripe releasing numerous tiny seeds.The genus namePenstemonlikely comes from the Latinpaenemeaning \"almost\" or \"nearly\" and the Greekstemonmeaning \"stamen\". The name may also comes from the Greekpentameaning \"five\" andstemonmeaning \"stamen\". Both refer to the fifth, sterile stamen (staminode) that characterizes members of this genus.Specific epithet comes from Latin meaning pale in reference to the pale white flowers and pale green foliage.Penstemons are sometimes commonly called beardtongues because the unusual sterile stamen contained in each flower has a tuft of small hairs."
}