{
    "Scientific Name": "carex pensylvanica ",
    "Common Name": "sedge",
    "Type": "Rush or Sedge",
    "Family": "Cyperaceae",
    "Native Range": "Eastern North America",
    "Zone": "3 to 8",
    "Height": "0.50 to 1.00 feet",
    "Spread": "0.50 to 1.00 feet",
    "Bloom Time": "May",
    "Bloom Description": "Greenish",
    "Sun": "Part shade to full shade",
    "Water": "Dry to medium",
    "Maintenance": "Low",
    "Suggested Use": "Ground Cover, Naturalize, Rain Garden",
    "Flower": "Insignificant",
    "Tolerate": "Heavy Shade, Wet Soil",
    "Noteworthy Characteristics": "Carex pensylvanica, commonly called Pennsylvania sedge, is a shade-loving perennial sedge that is native to thickets and dry woodland areas in Eastern and Central North America from Quebec to Manitoba south to Mississippi and Georgia.  In Missouri, it is found mostly north of the Missouri River in dry to mesic upland forests and shaded bluff ledges (Steyermark).  It typically grows in loose colonies with a creeping habit.  Roots are reddish brown.  It is often found in areas with oak trees, hence the additional common name of oak sedge.  This is a low sedge with soft, delicate, arching, semi-evergreen leaves (each to 1/8\"  wide).  It typically grows in a clump to 8\" tall.  It is semi-evergreen in moderately cold winter climates.  Narrow, grass-like, medium green leaves (to 8-12\" long) are typically shorter than the flowering stems.  Plants are monoecious (spikelets of male flowers above female flowers).  Flowers bloom in late spring (May) in inflorescences atop rough, sharply triangular culms (stems) which rise up singly from the rhizomes.  Staminate scales are green often tinged with reddish-purple with white margins.  Pistillate scales are dark brown to purplish black with green midribs and white margins.  Female flowers are followed by tiny fruits (achenes) enclosed in sac-like bracts (perigynia).Over 1500 species ofCarexgrow in a variety of habitats (often moist to wet areas) throughout the world.  Identification of individual species can be very difficult.Genus name from Latin means cutter in reference to the sharp leaves and stem edges (rushes are round but sedges have edges) found on most species' plants.Specific epithet means of Pennsylvania, USA. Over 1500 species ofCarexgrow in a variety of habitats (often moist to wet areas) throughout the world.  Identification of individual species can be very difficult.Genus name from Latin means cutter in reference to the sharp leaves and stem edges (rushes are round but sedges have edges) found on most species' plants.Specific epithet means of Pennsylvania, USA."
}