{
    "Scientific Name": "acer rubrum ",
    "Common Name": "red maple",
    "Type": "Tree",
    "Family": "Sapindaceae",
    "Native Range": "Eastern and central North America",
    "Zone": "3 to 9",
    "Height": "40.00 to 70.00 feet",
    "Spread": "30.00 to 50.00 feet",
    "Bloom Time": "March to April",
    "Bloom Description": "Red, sometimes yellow",
    "Sun": "Full sun to part shade",
    "Water": "Medium to wet",
    "Maintenance": "Low",
    "Suggested Use": "Shade Tree, Street Tree, Rain Garden",
    "Flower": "Showy",
    "Leaf": "Good Fall",
    "Attracts": "Birds",
    "Tolerate": "Wet Soil, Black Walnut, Air Pollution",
    "Noteworthy Characteristics": "Acer rubrum, commonly called red maple, is a medium-sized, deciduous tree that is native to Eastern North America from Quebec to Minnesota south to Florida and eastern Texas.  It typically grows 40-60’ tall with a rounded to oval crown.  It grows faster than Norway and sugar maples, but slower than silver maple.  In northern states, red maple usually occurs in wet bottomland, river flood plains and wet woods, but in Missouri it typically frequents drier, rocky upland areas.  Emerging new growth leaves, leafstalks, twigs, flowers, fruit and fall color are red or tinged with red.  Quality of red fall color on species plants is variable.  Leaves (to 2-5\" long) have 3 principal triangular lobes (sometimes 5 lobes with the two lower lobes being largely suppressed).  Lobes have toothed margins and pointed tips.  Leaves are medium to dark green above and gray green below.  Flowers on a given tree are primarily male or female or monoecious and appear in late winter to early spring (March-April) before the leaves.  Fruit is a two-winged samara. The seeds and flower buds are eaten by many species of birds. Caterpillars and other insects which feed on red maples are also a source of food for birds.Genus name is the Latin name for a maple tree.Specific epithet ofrubrummeaning red is everywhere in evidence: red flowers in dense clusters in late March to early April (before the leaves appear), red fruit (initially reddish, two-winged samara), reddish stems and twigs, red buds, and, in the fall, excellent orange-red foliage color."
}