{
    "Scientific Name": "erigeron pulchellus ",
    "Common Name": "Robin's plantain",
    "Type": "Herbaceous perennial",
    "Family": "Asteraceae",
    "Native Range": "Eastern and south-central United States",
    "Zone": "3 to 8",
    "Height": "1.50 to 2.00 feet",
    "Spread": "1.50 to 2.00 feet",
    "Bloom Time": "April to June",
    "Bloom Description": "Pale violet rays with yellow center disk",
    "Sun": "Full sun",
    "Water": "Dry to medium",
    "Maintenance": "Low",
    "Suggested Use": "Ground Cover, Naturalize",
    "Flower": "Showy",
    "Attracts": "Butterflies",
    "Tolerate": "Drought, Dry Soil",
    "Noteworthy Characteristics": "Erigeron pulchellus, commonly known as robin’s plantain, is an aster-like, stoloniferous, biennial to short-lived perennial that typically grows to 2’ tall on soft, hairy, hollow, unbranched, sparsely-leaved flowering stems rising from a basal clump of paddle-shaped, scalloped to bluntly toothed, soft and hairy leaves (2-6” long).  Stem leaves are shorter, stem-clasping, ovate to lanceolate and sparse.  This plant is native to rocky or open woods, thickets, fields, moist streambanks, disturbed areas and roadsides from Minnesota to Ontario, Quebec and Maine south to Florida, Louisiana and Texas.  In Missouri, it is commonly found in the eastern half of the State plus the Ozark region, but is absent from the northwestern part of the State.  Stems are topped in April to June with a profuse and showy bloom of small flowers (to 1 1/2” wide) in loose clusters (2-6 flowers per cluster).  Each flowerhead has 50-100 densely packed, thread-like, white to pale violet ray florets surrounding a yellow center disk.  Flowers resemble asters but have rays that are much narrower and more numerous.Genus name comes from the Greek wordserimeaning early andgeronmeaning old man in reference to the early bloom time and downy plant appearance suggestive of the white beard of an old man.Specific epithet from Latin means beautiful.Plants in the genusErigeronare often commonly called fleabane as a result of a once widely held theory that these plants repel fleas."
}