{
    "Scientific Name": "carya ovata ",
    "Common Name": "shagbark hickory",
    "Type": "Tree",
    "Family": "Juglandaceae",
    "Native Range": "Eastern North America",
    "Zone": "4 to 8",
    "Height": "70.00 to 90.00 feet",
    "Spread": "50.00 to 70.00 feet",
    "Bloom Time": "April to May",
    "Bloom Description": "Greenish-yellow",
    "Sun": "Full sun to part shade",
    "Water": "Medium",
    "Maintenance": "Low",
    "Suggested Use": "Shade Tree",
    "Flower": "Insignificant",
    "Leaf": "Good Fall",
    "Fruit": "Showy, Edible",
    "Other": "Winter Interest",
    "Tolerate": "Clay Soil, Black Walnut",
    "Noteworthy Characteristics": "Carya ovata, commonly called shagbark hickory, is a large deciduous tree that typically grows 70-90’ (infrequently to 120’) tall with an irregular, oval-rounded crown. It is native from Quebec to Minnesota south to Georgia and Texas. In Missouri, it typically occurs on both dry upland wooded slopes and hills and in moist valleys and lowland woods throughout the state (Steyermark). Trunks mature to 2-3’ in diameter. This tree features smooth, medium yellow-green, odd-pinnate, compound leaves, each leaf having 5 (less frequently 7 or 9) finely-toothed, broadly lance-shaped, pointed leaflets. Leaflets range from 3-7” long. Leaves turn yellow to golden brown in fall. Non-showy, monoecious greenish yellow flowers appear in April-May, the male flowers in pendulous catkins (to 3-5” long) and the female flowers in short spikes. Female flowers give way to edible oval-rounded nuts. Each nut is encased in a moderately thick husk which splits open in four sections when ripe in fall. Nuts were an important food source to Native Americans and early settlers, and are commercially sold today. Nuts are attractive to a variety of wildlife. Bark of young trees is gray and smooth, but exfoliates in long strips with age. The exfoliation is more recurved and pronounced than on the similar-in-appearance shellbark hickory (seeC. laciniosa). Hickory wood is often used to cure/smoke meats. It is also an excellent firewood/fuel. The wood is extremely hard and is used to make a variety of products including tool handles, ladders, gun stocks and furniture. Andrew Jackson, 7th president of the U.S., was affectionately known as Old Hickory in recognition of his tough character.Genus name comes from the Greek wordkaryaused for walnut trees.Specific epithet means egg-shaped."
}