{
    "Scientific Name": "hypericum prolificum ",
    "Common Name": "shrubby St. John's wort",
    "Type": "Deciduous shrub",
    "Family": "Hypericaceae",
    "Native Range": "Central and eastern North America",
    "Zone": "3 to 8",
    "Height": "1.00 to 5.00 feet",
    "Spread": "1.00 to 4.00 feet",
    "Bloom Time": "June to August",
    "Bloom Description": "Yellow",
    "Sun": "Full sun to part shade",
    "Water": "Medium",
    "Maintenance": "Low",
    "Suggested Use": "Hedge",
    "Flower": "Showy",
    "Attracts": "Birds",
    "Tolerate": "Drought, Erosion, Clay Soil, Black Walnut",
    "Noteworthy Characteristics": "Hypericum prolificum, commonly called  shrubby St. John's wort, is a Missouri native plant that occurs on rocky ground, dry wooded slopes, uncultivated fields, gravel bars along streams and in low, moist valleys. A compact, deciduous, rounded shrub with an erect habit that typically grows 1-4' (less frequently to 5') tall. Features 5-petaled, bright yellow flowers (to 1\" diameter) with numerous, yellow stamens. Stamens are bushy to the point of partially obscuring the petals (hence the species name ofprolificumwhich refers to the stamens). Flowers appear in terminal or axillary clusters (cymes) from early to mid summer. Dark green, narrow, oblanceolate leaves are 1-3\" long and 0.25-0.5\" wide. Cone-shaped seed capsules split in autumn to release black seeds. Bark of older stems exfoliates to reveal attractive, pale orange inner bark.Genus name comes from the Greek wordshypermeaning \"above\" andeikonmeaning \"picture\" in reference to the practice of hanging flowers from this genus above images, pictures or windows.Specific epithet means many or prolific in reference to the many stamens.Plants of the genusHypericum(some species have been used since ancient times in the treatment of wounds and inflammations) were apparently gathered and burned to ward off evil spirits on the eve of St. John's Day, thus giving rise to the genus common name of St. John's wort."
}