{
    "Scientific Name": "liriodendron tulipifera ",
    "Common Name": "tulip tree",
    "Type": "Tree",
    "Family": "Magnoliaceae",
    "Native Range": "Eastern North America",
    "Zone": "4 to 9",
    "Height": "60.00 to 90.00 feet",
    "Spread": "30.00 to 50.00 feet",
    "Bloom Time": "May to June",
    "Bloom Description": "Yellow with orange band at petal bases",
    "Sun": "Full sun",
    "Water": "Medium",
    "Maintenance": "Low",
    "Suggested Use": "Shade Tree, Street Tree, Flowering Tree",
    "Flower": "Showy",
    "Leaf": "Good Fall",
    "Attracts": "Birds, Hummingbirds",
    "Tolerate": "Rabbit, Deer, Clay Soil, Wet Soil, Black Walnut",
    "Noteworthy Characteristics": "Liriodendron tulipifera, commonly called tulip tree or yellow poplar, is a large, stately, deciduous tree of eastern North America that typically grows 60-90' (less frequently to 150’) tall with a pyramidal to broad conical habit. Although widely planted throughout the state of Missouri, it is indigenous to rich woods in only a few counties in the far southeastern corner of the state. Trunks of mature trees may reach 4-6’ in diameter, usually rising column-like with an absence of lower branching. It is named and noted for its cup-shaped, tulip-like flowers that bloom in spring. Flowers are yellow with an orange band at the base of each petal. Although the flowers are 2” in length, they can go unnoticed on large trees because the flowers appear after the leaves are fully developed. Sometimes the flowers are first noticed when the attractive petals begin to fall below the tree. Flowers are followed by dry, scaly, oblong, cone-shaped brown fruits, each bearing numerous winged seeds. Four-lobed bright green leaves (to 8” across) turn golden yellow in fall. Wood is used inter alia for furniture, plywood, boatbuilding, paper pulp and general lumber. Native Americans made dugout canoes from tuliptree trunks. This is the state tree of Kentucky, Tennessee and Indiana.Genus name comes from the Greek wordsleirionmeaning a lily anddendronmeaning a tree for the flowers.Specific epithet means tulip bearing for the form of the flowers."
}