{
    "Scientific Name": "hamamelis vernalis ",
    "Common Name": "Ozark witch hazel",
    "Type": "Deciduous shrub",
    "Family": "Hamamelidaceae",
    "Native Range": "Southern and central United States",
    "Zone": "4 to 8",
    "Height": "6.00 to 10.00 feet",
    "Spread": "8.00 to 15.00 feet",
    "Bloom Time": "January to April",
    "Bloom Description": "Yellow with red inner calyx",
    "Sun": "Full sun to part shade",
    "Water": "Medium",
    "Maintenance": "Low",
    "Suggested Use": "Rain Garden",
    "Flower": "Showy, Fragrant",
    "Leaf": "Good Fall",
    "Attracts": "Birds",
    "Other": "Winter Interest",
    "Tolerate": "Deer, Erosion, Clay Soil",
    "Noteworthy Characteristics": "Hamamelis vernalis, commonly called Ozark witch hazel, is native to the Ozark Plateau extending from southern Missouri through northwestern Arkansas to eastern Oklahoma.  In Missouri, it is typically found in gravelly stream beds, bases of rocky slopes along streams and less frequently in rocky wooded hillsides where it spreads by suckers to form large colonies (Steyermark).  It typically grows to 6' tall.  Flowers in axillary clusters appear in mid to late winter (January-March in St. Louis) prior to the emergence of the foliage in a variety of colors ranging from pale yellow to dark reddish purple.  Each flower has four, narrow, ribbon-like, curled and crinkled petals (each to only 1/3\" long) that are usually red at the base transitioning to copper orange at the tip.  Calyx cup is dull red.  Ovate-rounded leaves (to 3” long) emerge light green with reddish-bronze tints in spring, but quickly mature to medium to dark green.  Golden yellow fall color.  Fruit is a non-showy dehiscent capsule which splits open in September-October to release its seeds.Genus name comes from the Greek wordshamameaning at same time andmelonmeaning apple or fruit in reference to the occurrence of both fruit and flowers at the same time on this shrub (particularly in the case of fall flowering members of the genus).Specific epithet from Latin means spring in reference to the flower bloom."
}