{
    "Scientific Name": "parthenocissus quinquefolia ",
    "Common Name": "Virginia creeper",
    "Type": "Vine",
    "Family": "Vitaceae",
    "Native Range": "Eastern United States to Mexico",
    "Zone": "3 to 9",
    "Height": "30.00 to 50.00 feet",
    "Spread": "5.00 to 10.00 feet",
    "Bloom Time": "May to August",
    "Bloom Description": "Greenish white",
    "Sun": "Full sun to part shade",
    "Water": "Medium",
    "Maintenance": "Medium",
    "Flower": "Insignificant",
    "Leaf": "Good Fall",
    "Attracts": "Birds",
    "Fruit": "Showy",
    "Tolerate": "Deer, Drought, Heavy Shade, Erosion, Clay Soil, Black Walnut",
    "Noteworthy Characteristics": "Parthenocissus quinquefoliais a deciduous, woody vine that is commonly called Virginia creeper or woodbine.  It is native to eastern and central North America south to Mexico.  It occurs statewide in Missouri, typically being located in open areas of ravines, valleys, rich woods, thickets, rocky bluffs, hillsides and fencerows (Steyermark).  This is a vigorous tendril-climbing vine that will rapidly grow to 30-50’ long or more.  It needs no support because it clings to surfaces (e.g., brick, stone or wood walls) by adhesive holdfasts (also called sucker disks) located at the tendril ends. It also will creep along the ground as suggested by the common name.  Compound-palmate leaves (usually 5 saw-toothed leaflets, each leaflet to 6” long) emerge purplish in spring, mature to dull green in summer and change to attractive shades of purple and crimson red in fall.  Greenish white flowers in late spring to early summer appear in the upper leaf axils, but are generally hidden by the foliage and are ornamentally insignificant.  Flowers give way to blue-black berries (to 3/8” diameter) which are also hidden by the foliage and are often not visible until autumn leaf drop.  Birds eat the berries.Genus name comes from the Greek wordsparthenosmeaning a virgin andkissosmeaning ivy.Specific epithet means five-leaved in reference to the palmate leaves.  \n\n."
}