{
    "Scientific Name": "asclepias verticillata ",
    "Common Name": "whorled milkweed",
    "Type": "Herbaceous perennial",
    "Family": "Apocynaceae",
    "Native Range": "United States",
    "Zone": "4 to 9",
    "Height": "1.00 to 2.50 feet",
    "Spread": "1.00 to 2.00 feet",
    "Bloom Time": "June to September",
    "Bloom Description": "White",
    "Sun": "Full sun to part shade",
    "Water": "Dry to medium",
    "Maintenance": "Low",
    "Suggested Use": "Naturalize",
    "Flower": "Showy",
    "Attracts": "Hummingbirds, Butterflies",
    "Tolerate": "Deer, Drought, Dry Soil",
    "Noteworthy Characteristics": "Asclepias verticillata, commonly known as whorled milkweed, is an upright perennial that typically grows to 2.5’ tall on simple, usually unbranched stems clad with long, narrow, sessile, needle-like, linear leaves (each 2-3” long) with revolute margins arranged in whorls of 3 to 6 at each node along the length of the stems.  Stems ooze a milky sap when cut or broken.  This plant is native to glades, dry prairies, dry slopes, dry open woods, pastures, fields and roadsides in a large part of central and eastern North America extending from Massachusetts to Ontario and Saskatchewan south to Arizona and Florida.  In Missouri it is commonly found throughout the State except in the bootheel area.Flowers bloom in small clusters (umbellate cymes of 3-20 flowers) in the upper leaf axils and stem ends between June and September.  Flowers are fragrant.  Each tiny flower (to 1/4” long) has a 5 lobed calyx, 5 greenish-white corolla lobes and 5 white hoods with incurved horns protruding from each hood.  Flowers give way to smooth, narrow seed pods (to 3” long) which split open when ripe releasing numerous silky-tailed seeds for dispersal by the wind.Seed pods are valued in dried flower arrangements.Monarch butterflies need milkweed plants (Asclepiasgenus) in order to survive.  Monarchs lay their eggs on milkweed plants, caterpillars hatch from the eggs and consume the plant foliage as food for growth and development, and the flower nectar is consumed as a valuable source of food by adult monarchs.  Recent significant declines in monarch butterfly populations in North America are believed by many experts to be related to a corresponding significant decline in milkweed plants which in large part has been caused by an increased use of glyphosate herbicides around food crop areas where glyphosate-tolerant (Roundup Ready) crops are being grown.Genus name honors the Greek god Asklepios the god of medicine.Specific epithet comes from the Latin wordverticillatusmeaning whorled in reference to the leaves appearing in whorls.Common name suggests this plant is noted for its whorled leaves and milky sap.  Additional common names for this plant include horsetail milkweed. Flowers bloom in small clusters (umbellate cymes of 3-20 flowers) in the upper leaf axils and stem ends between June and September.  Flowers are fragrant.  Each tiny flower (to 1/4” long) has a 5 lobed calyx, 5 greenish-white corolla lobes and 5 white hoods with incurved horns protruding from each hood.  Flowers give way to smooth, narrow seed pods (to 3” long) which split open when ripe releasing numerous silky-tailed seeds for dispersal by the wind.Seed pods are valued in dried flower arrangements.Monarch butterflies need milkweed plants (Asclepiasgenus) in order to survive.  Monarchs lay their eggs on milkweed plants, caterpillars hatch from the eggs and consume the plant foliage as food for growth and development, and the flower nectar is consumed as a valuable source of food by adult monarchs.  Recent significant declines in monarch butterfly populations in North America are believed by many experts to be related to a corresponding significant decline in milkweed plants which in large part has been caused by an increased use of glyphosate herbicides around food crop areas where glyphosate-tolerant (Roundup Ready) crops are being grown.Genus name honors the Greek god Asklepios the god of medicine.Specific epithet comes from the Latin wordverticillatusmeaning whorled in reference to the leaves appearing in whorls.Common name suggests this plant is noted for its whorled leaves and milky sap.  Additional common names for this plant include horsetail milkweed. Seed pods are valued in dried flower arrangements.Monarch butterflies need milkweed plants (Asclepiasgenus) in order to survive.  Monarchs lay their eggs on milkweed plants, caterpillars hatch from the eggs and consume the plant foliage as food for growth and development, and the flower nectar is consumed as a valuable source of food by adult monarchs.  Recent significant declines in monarch butterfly populations in North America are believed by many experts to be related to a corresponding significant decline in milkweed plants which in large part has been caused by an increased use of glyphosate herbicides around food crop areas where glyphosate-tolerant (Roundup Ready) crops are being grown.Genus name honors the Greek god Asklepios the god of medicine.Specific epithet comes from the Latin wordverticillatusmeaning whorled in reference to the leaves appearing in whorls.Common name suggests this plant is noted for its whorled leaves and milky sap.  Additional common names for this plant include horsetail milkweed. Monarch butterflies need milkweed plants (Asclepiasgenus) in order to survive.  Monarchs lay their eggs on milkweed plants, caterpillars hatch from the eggs and consume the plant foliage as food for growth and development, and the flower nectar is consumed as a valuable source of food by adult monarchs.  Recent significant declines in monarch butterfly populations in North America are believed by many experts to be related to a corresponding significant decline in milkweed plants which in large part has been caused by an increased use of glyphosate herbicides around food crop areas where glyphosate-tolerant (Roundup Ready) crops are being grown.Genus name honors the Greek god Asklepios the god of medicine.Specific epithet comes from the Latin wordverticillatusmeaning whorled in reference to the leaves appearing in whorls.Common name suggests this plant is noted for its whorled leaves and milky sap.  Additional common names for this plant include horsetail milkweed."
}