{
    "Scientific Name": "erythronium americanum ",
    "Common Name": "yellow trout-lily",
    "Type": "Herbaceous perennial",
    "Family": "Liliaceae",
    "Native Range": "Eastern North America",
    "Zone": "3 to 8",
    "Height": "0.25 to 0.50 feet",
    "Spread": "0.25 to 0.50 feet",
    "Bloom Time": "April",
    "Bloom Description": "Yellow",
    "Sun": "Part shade to full shade",
    "Water": "Medium",
    "Maintenance": "Medium",
    "Suggested Use": "Naturalize",
    "Flower": "Showy",
    "Leaf": "Colorful",
    "Noteworthy Characteristics": "Erythronium americanum, commonly called yellow adder’s tongue, yellow trout lily, yellow fawn lily and yellow dog-tooth violet, is a Missouri native spring wildflower that occurs in moist woods, on wooded slopes and bluffs, and along streams in the southern part of the State (Steyermark). A single, nodding, bell- or lily-shaped yellow flower blooms atop a naked scape sheathed by two glossy, tongue-shaped, tulip-like, basal leaves (to 6” long) in early spring. Petal-like perianth segments are reflexed and often brushed with purple on the outside. Anthers are yellow to brown. Leaves are mottled with brown and purple. It typically grows 4-6” (infrequently to 9”) tall. Flowering plants always have two basal leaves, however colonies frequently have non-flowering plants with only a single leaf. The common name of adder’s tongue is in reference to the tongue-like shape of the flowering shoot as it rises up in spring and the supposed resemblance of the flower to the open mouth of a snake. The common name of trout lily is in reference to the mottled leaves and the appearance of the flowers during trout fishing season. The common name of fawn lily is in reference to the spotted leaves and the supposed resemblance of the two-leaved plant to the upright ears of a fawn. The common name of dog-tooth violet (it grows from tiny corms that purportedly resemble dogteeth and its flowers somewhat resemble violets) is unfortunately quite misleading because this flower is not a member of the violet family.Genus name comes from the Greek worderythronionfromerythrosmeaning red, originally the name for another plant.Specific epithet means of North or South America."
}